{"0": {"task": "Touch all objects that are triangular.", "TEACHER": {"observations": "I just drove my car and she followed me in the path", "signs": {}}, "STUDENT": {"observations": "Initially it was confusing, it felt like my teacher, like myself, was trying to get used to using the controls. But then I noticed that my teacher was hitting all the triangles in the area. Overall, I think my teacher did well. I liked that my teacher waited till I reached the shape. That gave me a clear indication of where I should be before what is next. As we get used to the controls, I would assume that the teaching and learning will become faster and clearer.", "signs": {}, "guess": "Drive and touch all triangles in the green area regardless of their color, size, or orientation."}}, "1": {"task": "Touch all objects that are triangular.", "TEACHER": {"observations": "I did drive the car and student followed my path", "signs": {}}, "STUDENT": {"observations": "The first time around, it appeared at though the teacher only hit the biggest triangles. The teacher then returned to the game area to communicate the task to me again. This time, they made it evident by hitting the small triangle head on instead of just parking by it. Then they moved back, waited for me to follow along, and moved forward and back pointing to the small triangle that I should also be hitting. That front and back motion was very indicative and useful.", "signs": {}, "guess": "Hit all the triangles regardless of color, size, and orientation."}}, "2": {"task": "Touch all objects that are blue.", "TEACHER": {"observations": "Drive my car and student followed me, It was not confusing , Student did great job, I dont think there is something that can be done differently", "signs": {}}, "STUDENT": {"observations": "I think the teacher made it quite clear. I would go in a circular motion when touching the instructed shapes when teaching as opposed to in random directions. That way, the pattern would be quicker to follow and smoother when using the controls to follow one smooth clockwise motion.", "signs": {}, "guess": "Touch all blue objects, regardless of shape and size, in the game area."}}, "3": {"task": "Touch all objects that are small.", "TEACHER": {"observations": "Drive my car and student followed me, It was not confusing , Student did great job, I dont think there is something that can be done differently", "signs": {}}, "STUDENT": {"observations": "The first time around, it was not evident. However, that was my fault. The past few involved triangles so it took me a while to realize that this wasn't just about triangles but also other shapes. Teacher did well. And especially well when jumping back in the game area and correcting me.", "signs": {}, "guess": "Touch the small shapes in the game area, regardless of color and shape."}}, "4": {"task": "Touch all objects that are red.", "TEACHER": {"observations": "Drive my car and student followed me, It was not confusing , Student did great job, I dont think there is something that can be done differently", "signs": {}}, "STUDENT": {"observations": "The teacher communicated it well. However, when the teacher was teaching, the game area only had 2 red shapes and both were triangles. Whereas the subsequent solo game had two red shapes with one triangle and one square. There is no way that the teacher could have told me if it's all red shapes or if it is only red triangles. So I took a leap of faith and went for all red shapes. Since the teacher did not jump back into the game to correct it, it was clear that the instruction was to choose all red shapes.", "signs": {}, "guess": "Touch all the red shapes, regardless of shape and size."}}, "5": {"task": "While going backwards, touch at least one but not all objects that are big, or touch at least one but not all objects that are not [small].", "TEACHER": {"observations": "Drive my car and student followed me, It was not confusing , Student did great job, I dont think there is something that can be done differently", "signs": {}}, "STUDENT": {"observations": "It was confusing at the beginning, but then the teacher touched only green and red or various sizes and shapes a few times. The teacher didn't waste time doing all green and red shapes because they were many. They let me try it out once they thought I got the hang of it only after a few demonstrations.", "signs": {}, "guess": "Touch all green and red shapes, regardless of shape and size."}}, "6": {"task": "While going forwards, touch all objects that are triangular.", "TEACHER": {"observations": "Drive my car and student followed me, It was not confusing , Student did great job, I dont think there is something that can be done differently", "signs": {}}, "STUDENT": {"observations": "It wasn't clear at the beginning because the training only had one shape: a small red triangle. This could be many things. (1) all red shapes (2) all small shapes (3) all triangles (4) all red small shapes (5) all small triangles (6) all red triangles (7) all small red triangles. The chances of getting the pattern right was 1/7 (in case I missed any possible combinations). So it was a lot of trial and error on my part, testing one possibility at a time, and then waiting to see my teacher's response of jumping back (wrong guess) in or letting me be (right guess). There is really nothing that the teacher could have done to communicate this better because the teacher did not have any other options. Comes to show that the student shouldn't just blindly follow the teacher, but also but their own thinking to use - learning is a collaborative process regardless of the teacher-student hierarchy.", "signs": {}, "guess": "Touch all small triangles, regardless of color."}}, "7": {"task": "Touch all objects that are [small and green] or square, or while going backwards, touch exactly one object that is [big and triangular].", "TEACHER": {"observations": "I did drive the car but partner didnt followed properly", "signs": {}}, "STUDENT": {"observations": "It wasn't evident in the teaching game area because there were only green and blue shapes, and all small shapes were green. Even though the teacher only touched small green shapes, it could have meant all small shapes, or all small green shapes. Again, a gamble when playing. But the teacher didn't intervene so it looks like small green shapes was correct.", "signs": {}, "guess": "Touch all small green shapes, regardless of shape."}}, "8": {"task": "While going forwards, touch at least one but not all objects that are blue.", "TEACHER": {"observations": "Drive my car and student followed me, It was not confusing , Student did great job, I dont think there is something that can be done differently", "signs": {}}, "STUDENT": {"observations": "I feel like the teacher and I are building an understanding. The teacher is able to strategically pick the touch shapes so that they get the message across but don't have to touch all of them because that can be time consuming. As the student, I can also sit back and watch the pattern instead of having to actually follow along through action. At the same time, I do want to move a little bit to show the teacher that I am still present and paying attention, but I'm not learning through observation and not by doing (because that is possible with this game).", "signs": {}, "guess": "Touch all big shapes, regardless of shape and color."}}, "9": {"task": "Touch all objects that are [small and red].", "TEACHER": {"observations": "Drive my car and student followed me, It was not confusing , Student did great job, I dont think there is something that can be done differently", "signs": {}}, "STUDENT": {"observations": "See response written in the previous/above text box for context.", "signs": {}, "guess": "The last time I played was a few days ago and my partner logged off the game before i could complete my reflection. Everything got lost and I forgot what the previous game was. So I have nothing to write for this one."}}, "10": {"task": "Touch all objects that are triangular.", "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}, "STUDENT": {"observations": "Teacher communicated this round well, can't think of any improvements", "signs": {}, "guess": "Hit all triangles regardless of color and size."}}, "11": {"task": "While going backwards, touch at least one but not all objects that are triangular.", "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}, "STUDENT": {"observations": "Teacher communicated this round well, can't think of any improvements", "signs": {}, "guess": "Hit all triangles regardless of size and color"}}, "12": {"task": "While going forwards, touch at least one object that is triangular.", "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}, "STUDENT": {"observations": "Teacher communicated this round well, can't think of any improvements", "signs": {}, "guess": "Hit all triangles regardless of size and color"}}, "13": {"task": "While going forwards, touch all objects that are square, or while going backwards, touch at least one object that is triangular.", "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}, "STUDENT": {"observations": "I'm not sure if I got it correct, but I don't think the teacher had many options to communicate the point correctly. But because the teacher didn't jump in to correct, I'm assuming it may have been correct. Hard to say.", "signs": {}, "guess": "Hit all shapes of the same color, regardless of shape and size. Pick the color that covers majority of the shapes in the area."}}, "14": {"task": "While going forwards, touch exactly two objects that are green.", "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}, "STUDENT": {"observations": "Again, I don't think there is much the teacher could do to communicate better. It would help if the teaching arena had more diverse shapes to give more comparison.", "signs": {}, "guess": "Select all shapes of the same color, with the most commonly appearing color in the arena"}}, "15": {"task": "While going forwards, touch at least one object that is not [red or triangular], or while going forwards, touch at least one but not all objects that are green or small.", "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}, "STUDENT": {"observations": "Again, don't think the teacher could have done much more to explain. The teaching area is very different from the student's area when attempting, leaving lots of room for making assumptions.", "signs": {}, "guess": "Hit all shapes that are green and red, regardless of shape and size."}}, "16": {"task": "Touch all objects that are red.", "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}, "STUDENT": {"observations": "If the teaching area has all the same colored shapes, if the teacher is trying to indicate it is both big and small shapes, it would help to hit a balance of big and small shapes when demonstrating to the student. If the teacher hits all big shapes and one small shape, it can be easy to assume that hitting the small shape was a mistake.", "signs": {}, "guess": "Hit all shapes that are red, regardless of shape and size"}}, "17": {"task": "Touch all objects that are not [big].", "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}, "STUDENT": {"observations": "Teacher communicated this round well, can't think of any improvements", "signs": {}, "guess": "Hit all squares, regardless of color and size"}}, "18": {"task": "Touch all objects that are square.", "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}, "STUDENT": {"observations": "Teacher communicated this round well, can't think of any improvements", "signs": {}, "guess": "Hit all squares, regardless of color and size"}}, "19": {"task": "Touch exactly one object that is not [small].", "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}, "STUDENT": {"observations": "Teacher communicated this round well, can't think of any improvements", "signs": {}, "guess": "Hit small squares, regardless of color"}}, "20": {"task": "While going forwards, touch at least one but not all objects that are triangular or big.", "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}, "STUDENT": {"observations": "There was only one shape in the teaching area. Couldn't tell what the task was based on that. Don't think the teacher could have done anything else to clarify that more", "signs": {}, "guess": "Hit the big blue triangles"}}, "21": {"task": "Touch at least one object that is blue.", "STUDENT": {"observations": "Only one shape in teaching area. Teacher couldn't have done anything to communicate better. I'm making assumptions based on the shapes presented in the teaching area.", "signs": {}, "guess": "Hit big squares, regardless of color."}, "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}}, "22": {"task": "While going backwards, touch exactly one object that is big or red or small, or while going forwards, touch at least one object that is triangular.", "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}, "STUDENT": {"observations": "If the above is untrue, the training area had a lot of options and the teacher could have demonstrated more to create a pattern that told me what the task was.", "signs": {}, "guess": "Not sure, but assuming red triangles regardless of size."}}, "23": {"task": "Touch all objects that are small.", "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}, "STUDENT": {"observations": "Teacher communicated this round well, can't think of any improvements", "signs": {}, "guess": "Small squares, regardless of color"}}, "24": {"task": "Touch exactly one object that is square.", "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}, "STUDENT": {"observations": "Don't think teacher had much option in trying to communicate the task better.", "signs": {}, "guess": "Small squares, regardless of color"}}, "25": {"task": "Touch at least one but not all objects that are not [square or [big and triangular]].", "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}, "STUDENT": {"observations": "Was very confused when the teacher wasn't moving and it skipped to the game. But since there was no blue in the teaching area, but was in the student's playing area, I assumed the task was to select a color that wasn't there in the teaching area.", "signs": {}, "guess": "Hit all blue shapes, regardless of shape and size."}}, "26": {"task": "Touch all objects that are not [big or small] or not [blue].", "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}, "STUDENT": {"observations": "I'm very confused. I don't know what the task was.", "signs": {}, "guess": "Hit all green and red shapes, regardless of size and shape"}}, "27": {"task": "While going backwards, touch at least one object that is small or red, and while going forwards, touch at least one object that is square, or while going backwards, touch at least one object that is big.", "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}, "STUDENT": {"observations": "Teacher communicated this round well, can't think of any improvements.", "signs": {}, "guess": "Select red squares, regardless of size."}}, "28": {"task": "While going backwards, touch all objects that are small.", "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}, "STUDENT": {"observations": "Teacher communicated this round well, can't think of any improvements", "signs": {}, "guess": "Hit all small triangles, regardless of color."}}, "29": {"task": "Touch at least one object that is green.", "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}, "STUDENT": {"observations": "Teacher communicated this round well, can't think of any improvements", "signs": {}, "guess": "It took the teacher really long to go onto the reflection for this game. I forgot what the task was."}}, "30": {"task": "Touch exactly one object that is triangular.", "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}, "STUDENT": {"observations": "Not sure if task is perceived correctly. May have been big green triangles instead of any shape at all.", "signs": {}, "guess": "Select big green shapes, regardless of shape"}}, "31": {"task": "While going backwards, touch all objects that are big, or while going backwards, touch at least one but not all objects that are blue.", "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}, "STUDENT": {"observations": "Not sure if task is perceived correctly. But don't think the teacher could have done anything else to communicate better. The teaching arena wasn't effective in communicating it correctly perhaps.", "signs": {}, "guess": "Hit the big blue squares"}}, "32": {"task": "Touch exactly one object that is big.", "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}, "STUDENT": {"observations": "Teacher communicated this round well, can't think of any improvements", "signs": {}, "guess": "Hit all big green squares."}}, "33": {"task": "While going forwards, touch exactly two objects that are [red and triangular], or while going backwards, touch at least one but not all objects that are green.", "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}, "STUDENT": {"observations": "Can't say with confidence if I understood the task properly.", "signs": {}, "guess": "Hit any small red squares"}}, "34": {"task": "Touch all objects that are big.", "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}, "STUDENT": {"observations": "Can't tell if I got the task correct, filled with doubt.", "signs": {}, "guess": "Hit all big squares, regardless of color."}}, "35": {"task": "While going backwards, touch exactly one object that is not [red], or touch all objects that are big or triangular.", "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}, "STUDENT": {"observations": "I have no idea what the task was, it was very unclear", "signs": {}, "guess": "I have no idea what the task was"}}, "36": {"task": "Touch all objects that are triangular.", "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}, "STUDENT": {"observations": "Again, I have no idea if I am correct or not.", "signs": {}, "guess": "Hit big triangles, regardless of color"}}, "37": {"task": "Touch exactly one object that is big, or while going forwards, touch at least one but not all objects that are not [small].", "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}, "STUDENT": {"observations": "Teacher communicated this round well, can't think of any improvements", "signs": {}, "guess": "Hit all big blue shapes, regardless of shape"}}, "38": {"task": "While going forwards, touch exactly one object that is triangular.", "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}, "STUDENT": {"observations": "There were a lot of options in the teaching area this time. Would have been nice to hit more shapes if possible since the options were there.", "signs": {}, "guess": "Hit all big blue shapes, regardless of shape."}}, "39": {"task": "Touch all objects that are green.", "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}, "STUDENT": {"observations": "I'm unsure if this is correct. But there is nothing else the teacher could have done to demonstrate otherwise because the options in the teaching area were quite limited.", "signs": {}, "guess": "Hit all small green triangles."}}, "40": {"task": "Touch exactly one object that is [partially but not all] blue.", "STUDENT": {"observations": "There was nothing in the teaching area, can't tell what the task was.", "signs": {}, "guess": "I have no idea what the task was."}, "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}}, "41": {"task": "Touch exactly one object that is square on the outside and triangular on the inside.", "TEACHER": {"observations": "It really went well and did not have any issues", "signs": {}}, "STUDENT": {"observations": "I was not paying attention to the teaching in this round, so I have no idea.", "signs": {}, "guess": "I was not paying attention to the teaching in this round, so I have no idea."}}, "42": {"task": "Touch exactly three objects that are red.", "STUDENT": {"observations": "The teaching arena was empty and the teacher didn't move. I have no idea what's happening!", "signs": {}, "guess": "The task was to stay still? If not, then I have no idea."}, "TEACHER": {"observations": "It went well, she followed me in the process h", "signs": {}}}, "43": {"task": "Touch all but one objects that are triangular.", "TEACHER": {"observations": "It went well, she followed me in the process h", "signs": {}}, "STUDENT": {"observations": "I thought this was a really cool experiment. Would love to be updated once the research is published!", "signs": {}, "guess": "To stay still, perhaps. I'm not sure."}}}