{"0": {"task": "Touch all objects that are square.", "STUDENT": {"observations": "Many colors were confusing. We chatted to understand whats better", "signs": {}, "guess": "It was difficult to understand what need to be done. There were 3 different colors which made me confused"}, "TEACHER": {"observations": "It was a bit time-consuming and confusing to relay without any chatting and how to distinguish between colors and shapes", "signs": {}}}, "1": {"task": "Touch all objects that are small.", "TEACHER": {"observations": "I thought it was much clearer and we were able to get the hang of it. I think we both did a good job and my partner was able to execute it perfectly!", "signs": {}}, "STUDENT": {"observations": "Just using map, no chat. Understanding the task better now", "signs": {}, "guess": "This was easy and can be done easily"}}, "2": {"task": "Touch all objects that are big.", "TEACHER": {"observations": "My partner did super well ! They were able to understand and execute it with only one teaching lesson. I think these instructions were less confusing for the both of us to teach and understand.", "signs": {}}, "STUDENT": {"observations": "Just using map. Nothing confusing, Good job, Not that I can think of", "signs": {}, "guess": "Again it was a simple one"}}, "3": {"task": "Touch all objects that are green.", "STUDENT": {"observations": "Just using map. Nothing confusing, Good job, Not that I can think of", "signs": {}, "guess": "Again it was a simple one"}, "TEACHER": {"observations": "I think we communicated very efficiently and were able to successfully execute the instructions! My partner did great in understanding what I was trying to say", "signs": {}}}, "4": {"task": "Touch all objects that are small.", "TEACHER": {"observations": "This one was a bit more confusing; I feel like we didn't know whether or not instructions could be repeated so my partner tried to find other patterns", "signs": {}}, "STUDENT": {"observations": "Just by map, There was no square in teacher map and it was very difficult to judge in student map", "signs": {}, "guess": "This was very confusing and took time"}}, "5": {"task": "While going forwards, touch at least one object that is not [red or triangular], or while going forwards, touch at least one but not all objects that are green or small.", "TEACHER": {"observations": "We probably accidentally got the correct solution but I think there was still a bit of misunderstanding", "signs": {}}, "STUDENT": {"observations": "Just using map. Nothing confusing, Good job, difficult to navigate", "signs": {}, "guess": "Easy to understand, difficult to navigate"}}, "6": {"task": "Touch all objects that are red.", "STUDENT": {"observations": "Just using map. Nothing confusing, Good job, Not that I can think of", "signs": {}, "guess": "Again it was a simple one"}, "TEACHER": {"observations": "This round went pretty smoothly. I realized that the timing of resetting is important because it help shows exactly when the error was made", "signs": {}}}, "7": {"task": "Touch all objects that are triangular.", "TEACHER": {"observations": "What makes the tasks difficult is that because there's few test shapes it's hard to generalize to more shapes", "signs": {}}, "STUDENT": {"observations": "Just map only. confusing between sizes. Ok job, one more small size in teacher would have helped", "signs": {}, "guess": "It was bit confusing between sizes"}}, "8": {"task": "While going forwards, touch exactly one object that is not [big], or while going backwards, touch at least one but not all objects that are square.", "TEACHER": {"observations": "I tried touching every small single object once. But this time it seemed he overgeneralized which was opposite to prior problems", "signs": {}}, "STUDENT": {"observations": "Just using map. Some what difficult in the initial stage", "signs": {}, "guess": "Some what difficult in the initial stage"}}, "9": {"task": "While going backwards, touch all objects that are not [square].", "TEACHER": {"observations": "This task took a while. But I think it's because the student didn't know that there was a distinction between backward and forward", "signs": {}}, "STUDENT": {"observations": "Just using map. Reverse going of cars. Somewhat ok I guess", "signs": {}, "guess": "Haha. I didn't know reverse matters"}}, "10": {"task": "While going forwards, touch exactly two objects that are triangular or [big and red], or while going forwards, touch at least one but not all objects that are small.", "STUDENT": {"observations": "Just using map. first confusing, Good job, Not that I can think of", "signs": {}, "guess": "At first was confusing, after that was easy"}, "TEACHER": {"observations": "The person understood the first rule but it might've been a lost cause trying to explain the second rule", "signs": {}}}, "11": {"task": "While going forwards, touch exactly two objects that are green.", "TEACHER": {"observations": "I don't think the student knew the rule exactly. But if you know the maps you can retrospectively make up a new rule that still fulfills the original rule", "signs": {}}, "STUDENT": {"observations": "Just using map. Somewhat confusing, Good job, Not that I can think of", "signs": {}, "guess": "Somewhat interesting. Took less time to figure out"}}, "12": {"task": "Touch exactly one object that is not [small].", "STUDENT": {"observations": "Just using map. Nothing confusing, Good job, Not that I can think of", "signs": {}, "guess": "Somewhat confusing, got it finally"}, "TEACHER": {"observations": "I don't think my partner realizes that you have to take the test data in aggregate. He thought the rule was a big triangle when I showed him examples with squares", "signs": {}}}, "13": {"task": "Touch exactly two objects that are triangular.", "STUDENT": {"observations": "Just using map. Nothing confusing, Good job, Not that I can think of", "signs": {}, "guess": "Again it was a simple one"}, "TEACHER": {"observations": "This round went well. But I think he could show the solution with the shortest path to show a more clear understanding", "signs": {}}}, "14": {"task": "Touch at least one object that is blue.", "STUDENT": {"observations": "Just using map. Nothing confusing, Good job, Not that I can think of", "signs": {}, "guess": "Again it was a simple one"}, "TEACHER": {"observations": "Wow that was fast. Almost like a different person. Maybe the learning curve is exponential or something", "signs": {}}}, "15": {"task": "Touch all objects that are blue.", "STUDENT": {"observations": "Just using map. Nothing confusing, Good job, Not that I can think of", "signs": {}, "guess": "Again it was a simple one"}, "TEACHER": {"observations": "That one went smoothly. I think it's easier to teach the general rules when there's a lot of shapes but harder when there are less shapes", "signs": {}}}, "16": {"task": "While going forwards, touch exactly one object that is [small and triangular].", "STUDENT": {"observations": "Just using map. Nothing confusing, Good job, Not that I can think of", "signs": {}, "guess": "Again it was a simple one"}, "TEACHER": {"observations": "This round was quick. However, I made a mistake as the teacher, giving an example that wasn't the most efficient path to a solution", "signs": {}}}, "17": {"task": "While going backwards, touch at least one object that is not [small] or blue.", "STUDENT": {"observations": "Just using map. Somewhat confusing, Ok job, Not that I can think of", "signs": {}, "guess": "Somewhat confusing. Also had trouble loading page"}, "TEACHER": {"observations": "Honestly I thought that this round would be impossible. But maybe you can also teach through what can not be done, not just what can be done. He picked up the backwards part quickly as well", "signs": {}}}, "18": {"task": "Touch all objects that are red.", "STUDENT": {"observations": "Just using map. Nothing confusing, Good job, Not that I can think of", "signs": {}, "guess": "Again it was a simple one"}, "TEACHER": {"observations": "He knew exactly what to do and it went well!", "signs": {}}}, "19": {"task": "Touch exactly one object that is big, or while going forwards, touch at least one but not all objects that are not [small].", "TEACHER": {"observations": "The round went well after a few attempts but I think they understood the instructions", "signs": {}}, "STUDENT": {"observations": "Just using map. Somewhat confusing, Good job, Not that I can think of", "signs": {}, "guess": "Again it was a simple one Somewhat confusing"}}, "20": {"task": "Touch at least one object that is not [big] or small, and while going backwards, touch exactly one object that is [green and triangular].", "TEACHER": {"observations": "I simply did not understand the instructions. My bad sorry", "signs": {}}, "STUDENT": {"observations": "Just using map. Nothing confusing, Good job, Not that I can think of", "signs": {}, "guess": "Again it was a simple one"}}, "21": {"task": "Touch all objects that are square.", "STUDENT": {"observations": "Just using map. Somewhat confusing, Good job, Not that I can think of", "signs": {}, "guess": "Somewhat confusing, got it finally"}, "TEACHER": {"observations": "This round went smoothly. I would not have done anything differently", "signs": {}}}, "22": {"task": "While going forwards, touch all objects that are not [[small and triangular] or big], or touch at least one but not all objects that are square.", "STUDENT": {"observations": "Just using map. Nothing confusing, Good job, Not that I can think of", "signs": {}, "guess": "Again it was a simple one"}, "TEACHER": {"observations": "I think the \"at least one\" mechanic is interesting because I wonder how it differs from an \"exactly one\" rule in terms of practice", "signs": {}}}, "23": {"task": "Touch all objects that are small.", "STUDENT": {"observations": "Just using map. Nothing confusing, Good job, Lot to do", "signs": {}, "guess": "Again it was a simple one"}, "TEACHER": {"observations": "Smooth lesson. The touch-all-of-one-type rules are a little tedious if there are a lot of shapes but there's a tradeoff between the work the teacher has to do and necessity for clarity maybe", "signs": {}}}, "24": {"task": "While going backwards, touch all objects that are [big and square], or while going forwards, touch exactly two objects that are small.", "STUDENT": {"observations": "Just using map. Somewhat confusing, Okay job, Not that I can think of", "signs": {}, "guess": "Somewhat confusing, got it finally"}, "TEACHER": {"observations": "My partner basically got both part of the rules, but I think it didn't give my partner credit for doing the first part correctly", "signs": {}}}, "25": {"task": "While going backwards, touch all objects that are green.", "STUDENT": {"observations": "Just using map. Nothing confusing, Good job, Not that I can think of", "signs": {}, "guess": "Again it was a simple one"}, "TEACHER": {"observations": "This round wasn't bad. I thought it was actually harder for the teacher than the student due to the time it took to do the examples. I was tempted to stop early because I was sure my partner for the gist but I didn't want to risk a lack of clarity", "signs": {}}}, "26": {"task": "Touch all objects that are small.", "TEACHER": {"observations": "Round went pretty smoothly. It's interesting that although there were more errors by the student the overall time of the round might have been shorter because the teaching example was short", "signs": {}}, "STUDENT": {"observations": "Just using map. Bit confusing first time, Good job, Not that I can think of", "signs": {}, "guess": "Again it was a simple one"}}, "27": {"task": "While going backwards, touch all objects that are [big and green] or blue, or touch exactly two objects that are small.", "TEACHER": {"observations": "I opted to not teach the first rule because it would've taken the student way too long to complete. However, it seemed that the student did the first map correctly but it wasn't registered", "signs": {}}, "STUDENT": {"observations": "Just using map. Nothing confusing, Good job, Not that I can think of", "signs": {}, "guess": "Again it was a simple one"}}, "28": {"task": "While going forwards, touch at least one but not all objects that are triangular or big.", "STUDENT": {"observations": "Just using map. Nothing confusing, Good job, Not that I can think of", "signs": {}, "guess": "Again it was a simple one"}, "TEACHER": {"observations": "The round went smoothly. My partner is getting better at picking up on the rules with numerical constraints", "signs": {}}}, "29": {"task": "While going backwards, touch exactly one object that is big.", "STUDENT": {"observations": "Just using map. Nothing confusing, Good job, Not that I can think of", "signs": {}, "guess": "Again it was a simple one"}, "TEACHER": {"observations": "It's interesting watching the student because you can tell whether they have a more specific idea of the rule than intended but it still works out with the maps. You can almost see what they're thinking. It gives me a God complex", "signs": {}}}, "30": {"task": "Touch all objects that are blue.", "STUDENT": {"observations": "Just using map. Nothing confusing, Good job, Not that I can think of", "signs": {}, "guess": "Again it was a simple one"}, "TEACHER": {"observations": "Round went smoothly. The teaching map had a good balance of brevity but clarity. Student is generally good at getting \"all of one type\" kind of rules", "signs": {}}}, "31": {"task": "While going backwards, touch at least one but not all objects that are small, or touch exactly one object that is triangular.", "STUDENT": {"observations": "Just using map. 1st bit confusing, Good job, Not that I can think of", "signs": {}, "guess": "Again it was a simple one"}, "TEACHER": {"observations": "Round went quicker than expected. Interesting that they got the second part of the rule even though the teaching example didn't have anything to do with triangles. Maybe just probability wise chose it. They probably thought the rule was \"touch one thing backwards.\" First map didn't register correctly", "signs": {}}}, "32": {"task": "Touch all objects that are blue.", "STUDENT": {"observations": "Just using map. Nothing confusing, Good job, Not that I can think of", "signs": {}, "guess": "Again it was a simple one"}, "TEACHER": {"observations": "Round went smoothly. It would be a good troll to make a rule \"touch all objects\" and just put a bunch of objects on the map", "signs": {}}}, "33": {"task": "Touch all objects that are triangular.", "STUDENT": {"observations": "Just using map. Nothing confusing, Good job, Some technical difficulties", "signs": {}, "guess": "Again it was a simple one"}, "TEACHER": {"observations": "Partner is still doing well on the all of one type rules. It's interesting that as you go on you can almost profile your partner's strengths and weaknesses like one of those hexagon graphs.", "signs": {}}}, "34": {"task": "Touch all objects that are square.", "STUDENT": {"observations": "Just using map. Somewhat confusing, okay job, Not that I can think of", "signs": {}, "guess": "Somewhat confusing, got it finally"}, "TEACHER": {"observations": "I take back what I said about my partner being good at the \"all of one type\" kind of questions. I wonder if he didn't consider the square in the bottom right because of the wall of triangles create some kind of subtle barrier", "signs": {}}}, "35": {"task": "While going backwards, touch exactly two objects that are triangular.", "TEACHER": {"observations": "It's kind of cute watching my partner because you can tell he thinks the rule is a big triangle then a small triangle. But in a strange way it's sad because he will never know the truth. And I couldn't reset because it would confuse him because he wasn't technically wrong", "signs": {}}, "STUDENT": {"observations": "Just using map. Nothing confusing, Good job, Not that I can think of", "signs": {}, "guess": "Again it was a simple one"}}, "36": {"task": "While going forwards, touch all objects that are square, or while going backwards, touch at least one object that is triangular.", "STUDENT": {"observations": "Just using map. Somewhat confusing, Okay job, Not that I can think of", "signs": {}, "guess": "Somewhat confusing, got it finally"}, "TEACHER": {"observations": "The two part rules are interesting because if the maps are constructed in a way that only one rule applies at a time you almost have to take a greedy approach to teaching because you can't teach both rules at once. Also I think my partner needs a notepad or something because he has the memory of a goldfish. By the third map he forgot the teaching example", "signs": {}}}, "37": {"task": "Touch all objects that are triangular.", "STUDENT": {"observations": "Just using map. Nothing confusing, Good job, Technical difficulties sometimes", "signs": {}, "guess": "Again it was a simple one"}, "TEACHER": {"observations": "Round went well. I wouldn't have done anything differently. I feel bad for bad mouthing my partner I'm sure he's a decent dude. But this game is actually kind of frustrating", "signs": {}}}, "38": {"task": "Touch all objects that are small.", "STUDENT": {"observations": "Just using map. Nothing confusing, Good job, Not that I can think of", "signs": {}, "guess": "Again it was a simple one"}, "TEACHER": {"observations": "This round was good. Now that I'm nearing the end I'm sad that the time with my partner is coming to a close. There's something bonding about a shared frustrating experience", "signs": {}}}, "39": {"task": "Touch at least one but not all objects that are big.", "STUDENT": {"observations": "Just using map. Somewhat confusing, Good job, Not that I can think of", "signs": {}, "guess": "Somewhat confusing, got it finally"}, "TEACHER": {"observations": "Yay we're done. I think it's interesting that sometimes you don't really need to teach but just give the other person multiple chances since with little teaching data the solution is just probabilistic", "signs": {}}}, "40": {"task": "Touch exactly one object that is square on the outside and triangular on the inside.", "STUDENT": {"observations": "Just using map. Somewhat confusing, Good job, Not that I can think of", "signs": {}, "guess": "Somewhat confusing, got it finally"}, "TEACHER": {"observations": "Wow I'm actually amazed we got that one fairly quickly. It's interesting you can transmit information about position on a blank screen and then they will learn for themselves", "signs": {}}}, "41": {"task": "Touch all but one objects that are triangular.", "STUDENT": {"observations": "Just using map. Nothing confusing, Good job, Not that I can think of", "signs": {}, "guess": "Somewhat confusing, got it finally"}, "TEACHER": {"observations": "My partner thought the rule was small triangle but I think the all but one was almost outside the realm of imagination. But stumbling on ⅔ wasn't bad so I moved on", "signs": {}}}, "42": {"task": "Touch exactly one object that is [partially but not all] blue.", "STUDENT": {"observations": "Just using map. Somewhat confusing, Good job, Not that I can think of", "signs": {}, "guess": "Somewhat confusing, got it finally"}, "TEACHER": {"observations": "I think it's cool that we've created an unspoken rule that we'll see the first map and then instantly reset. I can then show the position of one of the objects and then we can use resetting to teach him after that", "signs": {}}}, "43": {"task": "Touch exactly three objects that are red.", "STUDENT": {"observations": "There were some technical issues like page were not loading and sometimes was not able to see what teacher was showing", "signs": {}, "guess": "It was interesting and found easy because of all other rounds"}, "TEACHER": {"observations": "I thought the experiment was interesting as it made me question what counts as communication and how once a form of communication is established it's hard to stray from it without confusing your partner", "signs": {}}}}